dictionary = [['багаж', 'Груз пассажиров, отправленный для перевозки'], ['баранина', 'Овечье мясо как пища'], ['богомол', 'Крупное насекомое с передними ногами, приспособленными для хватания пищи'],
              ['вектор', 'Направленный отрезок'], ['вилка', 'Предмет столового прибора с острыми зубьями на длинной ручке'], ['гадюка', 'Ядовитая змея с плоской треугольной головой'],
              ['вожак', 'Человек, который ведет за собой кого-то'], ['гидропоника', 'Выращивание растений без грунта, на питательных растворах'], ['гуталин', 'Мазь для кожаной обуви'],
              ['демография', 'Наука о составе населения и его изменениях'], ['аист', 'Крупная перелетная птица с длинным прямым клювом'], ['азот', 'Газ, входящий в состав белков и нуклеиновых кислот'],
              ['аметист', 'Драгоценный камень фиолетового цвета'], ['антоним', 'Противоположное по значению слово'], ['абажур', 'Колпак, надеваемый на лампу'],
              ['диктатура', 'Ничем не ограниченная власть, опирающаяся на прямое насилие'], ['домофон', 'Устройство для переговоров между входом в дом и квартирами'], ['ефрейтор', 'Второе в порядке старшинства звание солдата'],
              ['епитимья', 'Церковное наказание, налагаемое духовником'], ['ёмкость', 'Вместилище для жидких и сыпучих тел'], ['желание', 'Влечение, стремление к осуществлению'],
              ['жаровня', 'Сосуд для горячего древесного угля'], ['жужелица', 'Хищный ночной жук'], ['забрало', 'Часть шлема, опускаемая на лицо'],
              ['зигзаг', 'Ломаная линия'], ['зритель', 'Тот, кто наблюдает происходящее со стороны'], ['иврит', 'Древнееврейский язык'],
              ['извилина', 'Волнистое искривление, изгиб'], ['инженер', 'Специалист с высшим техническим образованием'], ['ишемия', 'Местное обескровливание ткани в результате сужения просвета питающей её артерии'],
              ['йогурт', 'Заквашенное молоко с различными добавками'], ['каблук', 'Твердая часть обувной подошвы, набиваемая под пяткой'], ['катаракта', 'Помутнение хрусталика глаза'],
              ['колокол', 'Отлитый из медного сплава полый конус с языком'], ['конкуренция', 'Борьба за достижение больших выгод, преимуществ'], ['кутюрье', 'Художник-модельер, создающий коллекции модной одежды'],
              ['лагуна', 'Морской залив, отделенный от моря песчаной косой'], ['лоджия', 'Открытая галерея, примыкающая к зданию'], ['люстра', 'Висячий светильник из нескольких подсвечников для ламп'],
              ['мавзолей', 'Большое надгробное мемориальное сооружение'], ['мензурка', 'Аптечный или лабораторный сосуд с делениями для отмеривания жидкостей'], ['мозоль', 'Местное утолщение кожи от частого трения'],
              ['мортира', 'Короткоствольное артиллерийское орудие'], ['мятлик', 'Дикорастущий кормовой злак'], ['набалдашник', 'Род колпачка или утолщение на верхнем конце трости, палки'],
              ['нашатырь', 'Хлористый аммоний, бесцветные кристаллы'], ['номинал', 'Обозначенная стоимость'], ['нутрия', 'Болотный бобер, грызун с остистой шерстью'],
              ['оазис', 'Место в пустыне, где есть растительность и вода'], ['огузок', 'Бедренная часть туши'], ['окрошка', 'Холодное кушанье из кваса с зеленью и мелко нарубленным мясом'],
              ['опиум', 'Высушенный млечный сок из незрелых головок ядовитого мака'], ['оттепель', 'Теплая погода с таянием снега'], ['памятка', 'Книжка, листок с краткими наставлениями'],
              ['пингвин', 'Антарктическая короткокрылая плавающая птица'], ['плоскость', 'Поверхность, имеющая два измерения'], ['подагра', 'Болезнь поражения суставов, вызываемая нарушением нарушением обмена веществ'],
              ['половодье', 'Весенний разлив реки'], ['пьедестал', 'Возвышение, на которое поднимается победитель'], ['регламент', 'Правила, регулирующие порядок'],
              ['резекция', 'Операция удаления органа или его части'], ['ротор', 'Вращающася часть в машинах'], ['рюкзак', 'Заплечный вещевой мешок с карманами'],
              ['салфетка', 'Платок для вытирания губ после еды'], ['семинар', 'Групповые практические занятия под руководством преподавателя'], ['слабоумие', 'Пониженная умственная деятельность, оскудение психики'],
              ['соловей', 'Буро-серая птичка, отличающаяся красивым пением'], ['тангенс', 'Тригонометрическая функция, равная отношению синуса к косинусу'], ['террариум', 'Специальное помещение для содержания некрупных пресмыкающихся и земноводных'],
              ['тореадор', 'Общее название бойцов в корриде'], ['тугрик', 'Денежная единица Монголии'], ['узник', 'Человек, находящийся в заключении'],
              ['удилище', 'Часть удочки, длинная гибкая палка'], ['фабрика', 'Промышленное предприятие с машинным способом производства'], ['фольга', 'Тончайший металлический лист'],
              ['фрикаделька', 'Шарик из фарша, сваренный в бульоне'], ['химера', 'Скульптура фантастического чудовища'], ['холодец', 'Холодное кушанье из сгустившегося мясного навара'],
              ['хроника', 'Отдел сообщений в газете'], ['целлюлоза', 'Главная составная часть оболочки растительной клетки'], ['цикада', 'Прыгающее крылатое насекомое, издающее характерный стрекот'],
              ['чахотка', 'Прогрессирующее истощение организма'], ['чистилище', 'Место, где души умерших очищаются от грехов'], ['чифирь', 'Очень крепкий настой чая'],
              ['чучело', 'Точное воспроизведение животного, его фигура, покрытая шкурой'], ['шарлатан', 'Невежда, выдающий себя за знатока'], ['шельф', 'Прибрежная мелководная зона океана'],
              ['шифер', 'Глинистый сланец черного или серого цвета'], ['щеколда', 'Род дверного запора, металлическая пластинка с рычажком'], ['щёлочь', 'Едкое химическое соединение'],
              ['щавель', 'Травянистое растение с продолговатыми съедобными кислыми листьями'], ['экзекуция', 'Телесное наказание'], ['эталон', 'Точный образец установленной единицы измерения'],
              ['юбилей', 'Празднование по случаю годовщины'], ['юнкер', 'Воспитанник военного училища'], ['ядрица', 'Крупа из нераздробленных зерен гречихи'],
              ['янтарь', 'Окаменевшая живица древнейших хвойных деревьев'], ['ячмень', 'Гнойное воспаление желез у корней ресниц'], ['бижутерия', 'Украшения, имитирующие ювелирные изделия'],
              ['глинтвейн', 'Горячий напиток из красного вина с сахаром и пряностями']]
i = 0
words = []
while True:
    the_set = set(str(i) for i in range(100))
    for e in the_set:
        words += [dictionary[int(e)]]
    word = words[i]
    print(word[1])
    guess = '*' * len(word[0])
    boofer = ''
    guessed = []
    while guess != word[0]:
        print(guess + '\n')
        letGuess = input('Угадайте букву или слово целиком: ')
        if letGuess == word[0]:
            guess = word[0]
            break
        elif letGuess in word[0]:
            guessed += [letGuess]
            for i in range(len(guess)):
                if word[0][i] in guessed:
                    boofer += word[0][i]
                else:
                    boofer += '*'
            guess, boofer = boofer, ''
    print('\n' + str(guess))
    print('Поздравляем!!!')
    print('\n' * 33)
    i += 1
